{
  "title": "Colouring",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>How many tricolour flags are possible with 5 available colours such that two adjacent stripes must NOT be the same colour.</p>\n<p><img alt=\"\" src=\"images/Colouring_image_0.png\" class=\"Colouring_image_0\" /></p>",
    "correct_answer": "80",
    "hint": "<p>Think about how many different colours could go in the first section, then the second ...</p>",
    "explanation": "<p>There is a choice of 5 colours for the first section. Once a colour has been chosen, the second section cannot be the same. So there are only four colours to choose from for the second section. For the third section, there are four colours to choose from, as it cannot be the same colour as the second one yet it can be the same colour as the first one. Thus, the number of tricolour flags with 5 colours to choose from are 5×4×4 = 80.</p>"
  },
  "extension_1": {
    "statement": "<p>In how many different ways can I paint the five walls of a pentagonal room using red, blue and green paint so that no two adjacent walls are the same colour?</p>\n<p><img alt=\"\" src=\"images/Colouring_image_1.png\" class=\"Colouring_image_1\" /></p>",
    "hint": "<p>Fix one colour, say start with the top wall red, and try to list all the different options for the other walls.  </p>",
    "correct_answer": "30",
    "explanation": "<p><img alt=\"\" src=\"images/Colouring_image_2.png\" class=\"Colouring_image_2\" /></p>\n<p><em>Adapt above from nrich? https://nrich.maths.org/600/solution</em></p>"
  },
  "extension_2": {
    "statement": "<p>[Statement of an extension to the puzzle, fun fact, game or activity]</p>",
    "hint": "<p>[For puzzles: a hint towards the solution of the extension]</p>",
    "correct_answer": "[For puzzles: the correct answer for the extension]",
    "explanation": "<p>[Explanation of the extended fun fact or solution to the puzzle extension.]</p>"
  },
  "additional_information": {
    "about": "<p>[Background information, e.g. trivia, where the puzzle/etc is from, ...]</p>",
    "references": ""
  }
}
