{
  "title": "House",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>From how many vertices (points) is it possible to draw this figure by an uninterrupted movement of the pen, going through each line exactly once?</p>\n<p><img alt=\"\" src=\"images/House_image_0.png\" class=\"House_image_0\" /></p>",
    "correct_answer": "2",
    "hint": "<p>Try starting from the bottom left vertex (point).</p>",
    "explanation": "<p>We can draw the figure in one uninterrupted movement if we start at the bottom left or bottom right vertex. For example starting at the bottom left:</p>\n<p><img alt=\"\" src=\"images/House_image_1.png\" class=\"House_image_1\" /></p>\n<p>The degree of a vertex is the number of edges joining onto that vertex, and vertices are said to be odd or even according to whether the degree is odd or even. Euler circuits exist only in networks where there are no odd vertices, that is where all the vertices have an even number of edges ending there.</p>\n<p>Two edges are used each time the path visits and leaves a vertex because the circuit must use each edge only once. It follows that if the graph has an odd vertex then that vertex must be the start or end of the path and, as a circuit starts and ends at the same vertex, for a circuit to exist all the vertices must be even. When there are two odd vertices a walk can take place that traverses each edge exactly once but this will not be a circuit.</p>\n<p>Can you think why it is impossible to draw any graph with an odd number of odd vertices (e.g. one odd vertex)? Well the reason is that each edge has two ends so the total number of endings is even, so the sum of the degrees of all the vertices in a graph must be even, so there cannot be an odd number of odd vertices.</p>"
  },
  "extension_1": {
    "statement": "<p><a href=\"https://www.transum.org/Maths/Activity/without/\">https://www.transum.org/Maths/Activity/without/</a></p>\n<p><a href=\"https://nrich.maths.org/2326\">https://nrich.maths.org/2326</a></p>\n<p>https://en.wikipedia.org/wiki/Five_room_puzzle</p>\n<p>Do you want to go into this <a href=\"https://en.wikipedia.org/wiki/Three_utilities_problem#Solution\">https://en.wikipedia.org/wiki/Three_utilities_problem#Solution</a></p>\n<p>Might be able to get numerical answers here: http://datagenetics.com/blog/december22018/index.html</p>",
    "hint": "<p>[For puzzles: a hint towards the solution of the extension]</p>",
    "correct_answer": "[For puzzles: the correct answer for the extension]",
    "explanation": "<p>[Explanation of the extended fun fact or solution to the puzzle extension.]</p>"
  },
  "extension_2": {
    "statement": "<p>[Statement of an extension to the puzzle, fun fact, game or activity]</p>",
    "hint": "<p>[For puzzles: a hint towards the solution of the extension]</p>",
    "correct_answer": "[For puzzles: the correct answer for the extension]",
    "explanation": "<p>[Explanation of the extended fun fact or solution to the puzzle extension.]</p>"
  },
  "additional_information": {
    "about": "<p>[Background information, e.g. trivia, where the puzzle/etc is from, ...]</p>",
    "references": ""
  }
}
