{
  "title": "Mixed-up Socks",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>You have a pair of red socks, a pair of blue socks, a pair of yellow socks, and a pair of green socks. In how many ways can you mix them up and form new pairs so that all the new pairs are mismatched, and none of the new (mismatched) pairs is the same as another new (mismatched) pair? </p>",
    "correct_answer": "3",
    "hint": "<p>Start with matching one of the red with one of the green, and the other red with a blue. You could write this as RB, RY. What would the other two pairs have to be? </p>",
    "explanation": "<p>You can solve this problem by listing all the options. You could have RB, RY, YG, BG or RB,RG, GY, BY or RY, RG, YB, GB. You could also solve it by thinking that, starting with the red socks, there are three different colours that the two socks could be matched with. If you choose RB and RY as the first two pairs, you can't then match BY together because that would leave GG for the last pair which isn't allowed. So once you have picked the two colours to go with red, there are no more choices to make. There are 3 ways to pick two colours from a choice of three, so the answer is 3.</p>"
  },
  "extension_1": {
    "statement": "<p>You have five pairs of socks, each a different colour (red, blue, yellow, green, orange). Mix them up and form new pairs so that all the new pairs are mismatched, and none of the new (mismatched) pairs is the same as another new (mismatched) pair. </p>\n<p>In how many ways can you mix them up and form new pairs in this way?</p>",
    "hint": "<p>Start off with the two red socks. Can you work out how many ways there are of choosing which two colours these two socks could be matched with?</p>",
    "correct_answer": "12",
    "explanation": "<p>Starting with the red socks, there are four different colours that the two socks could be matched with. If you choose RB and RY as the first two pairs, you cannot then have BY as a pair. This is because it would only leave two green and two orange socks and you can't have GG or OO and you can't have GO twice. You could match the second blue sock with green or orange. Once you choose one the other two pairs are fixed. For example RB, RY, BG then it must be OG and OY. </p>\n<p>There are 6 ways to pick two colours from a choice of four, and then 2 ways to pick one colour from a choice of two, so the answer is 6×2 = 12.</p>"
  },
  "extension_2": {
    "statement": "<p>Consider ten pairs of socks, each a different color. Now mix them up and form new pairs so that  all new pairs are mismatched, and none of the new (mismatched) pairs is the same as another new (mismatched) pair. </p>\n<p>In how many ways can you mix them up and form new pairs in this way?</p>",
    "hint": "<p>[For puzzles: a hint towards the solution of the extension]</p>",
    "correct_answer": "22680  ",
    "explanation": "<p>[Explanation of the extended fun fact or solution to the puzzle extension.]</p>"
  },
  "additional_information": {
    "about": "<p>For four different pairs of socks, if they were loose in a drawer and you shut your eyes and matched them together at random there would be a x% chance of matching them perfectly and a y% chance of matching them completely wrongly as in the puzzle.</p>",
    "references": ""
  }
}
