{
  "title": "Pieces of Cake",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>What is the biggest number of pieces of a circular cake you can obtain with 5 straight cuts? Cuts must be made on the top of the cake.</p>",
    "correct_answer": "16",
    "hint": "<p>Start with a small number of cuts, e.g. 1, 2, 3. How can you add another cut to get the biggest number of pieces? Remember it doesn't say that the pieces have to be of the same size! What happens if many cuts pass through the same point?</p>",
    "explanation": "<p>It is best to start with a simpler question and look for patterns. Start by looking at a square. There are two different ways we could slice the cake. </p>\n<p><img alt=\"\" src=\"images/Triangular_Slices_image_1.png\" class=\"Triangular_Slices_image_1\" /></p>\n<p>For a pentagon there are five ways:</p>\n<p><img alt=\"\" src=\"images/Triangular_Slices_image_2.png\" class=\"Triangular_Slices_image_2\" /></p>\n<p>For a hexagon there are 14 ways as you can see below:</p>\n<p><img alt=\"\" src=\"images/Triangular_Slices_image_3.png\" class=\"Triangular_Slices_image_3\" /></p>\n<p>In this diagram you can see the solution is found by thinking of 6 + 3 + 2 + 3 = 14, but you can arrive at the solution by using the solutions for smaller polygons: If we consider the side of the hexagon connecting points 1 and 2, it can form a triangle with any of the other 4 points. If we pick point 3 or 6, we are left with a pentagon, for which we know there are 5 ways of triangulating it. If we pick point 4 or 5, we are left with a triangle and a square, for which there are 1×2 ways. Adding up the number of choices gives us 5 + 2 + 2 + 5 = 14. The equivalent combination for the pentagon is 2 + 1 + 2 = 5, where 1 is the result of the triangle (which has of course only one option) and 2 is the result for a square.</p>\n<p>This is a more useful technique for moving on to thinking of polygons with more vertices.</p>"
  },
  "extension_1": {
    "statement": "<p>What is the biggest number of pieces of cake you can obtain with 7 cuts?</p>",
    "hint": "<p>As the number of cuts increases, drawing and counting might be too complicated: can you spot the pattern in the sequence of numbers obtained from previous examples? For 7 cuts, first work out the answer for 6 cuts and then use this result.</p>",
    "correct_answer": "29",
    "explanation": "<p>You might realise that there is a formula for obtaining the next number in the sequence from the previous one. You can see this by working out the number of new pieces created when you add an extra cut. For example, adding a fourth cut to 7 pieces obtained from 3 cuts adds 4 new pieces (11). Adding a fifth cut to this adds 5 new pieces (16). (Can you see why this is true in general when thinking about how we cross the existing cuts to create the most pieces?)</p>\n<p>So if C is the number of cuts and P(C) is the maximum number of pieces from C cuts, then the formula is: </p>\n<p>P(C + 1) = P(C) + C + 1</p>\n<p>Therefore:\nP(6) = P(5) + 5 + 1 = 16 + 6 = 22\nP(7) = P(6) + 6 + 1 = 22 + 7 = 29</p>"
  },
  "extension_2": {
    "statement": "<p>Can you work out the biggest number of pieces you can get with 99 cuts?</p>",
    "hint": "<p>Once you've found out the pattern, try to find a simple formula for the maximum number of pieces. Triangular numbers might help.</p>",
    "correct_answer": "4951",
    "explanation": "<p>We found the formula P(C + 1) = P(C) + C + 1 for the maximum number of pieces giving the cuts. However, this is not practical to use for the case of 99 cuts because we would first need to know the number of pieces for 98 cuts, and then the number of pieces for 97 cuts, and so on. You have to think how to get the explicit formula: P(C) = ½×C×(C + 1) + 1.</p>\n<p>Either by intuition or by using the formula to work back from P(C) to P(1):\nP(C) = P(C - 1) + C - 1 + 1 </p>\n<p>= P(C - 1) + C  </p>\n<p>= P(C - 2) + (C - 1) + C</p>\n<p>= P(C - 3) + (C - 2) + (C - 1)  + C</p>\n<p>… </p>\n<p>= P(1) + 2 + 3 … + (C - 2) + (C - 1) + C</p>\n<p>= 2 + (2 + 3 + … + C)</p>\n<p>= 1 + (1 + 2 + 3 + … + C) </p>\n<p>= 1 + ½×C×(C + 1)</p>\n<p>The last step is obtained from what we know about triangular numbers.\nTherefore, P(99) = ½×99×100 = 4951.</p>\n<p>This problem is related to the number of regions (pieces of the cake) in a plane bounded by a generic configuration of lines (cuts). \"Generic\" means that there are no parallel lines and that no more than two lines intersect in the same points. This guarantees that the number of pieces of cake is maximal. Given C lines on a plane (in a generic configuration), then adding an extra line such that it intersects all the previous lines would create (C+1) new regions (around each intersection point of the new line with the previous ones, we add two new regions. However, one of the two is counted also in the next intersection point). This leads to P(C + 1) = P(C) + C + 1.</p>"
  },
  "additional_information": {
    "about": "<p>If you were allowed to cut the cake in any direction, not just from the top, with just three cuts you could cut it into 8 pieces (rather than only 6)!</p>",
    "references": [
      "<p><a href=\"http://www.murderousmaths.co.uk/teacher/pizza.htm\" target=”_blank”>http://www.murderousmaths.co.uk/teacher/pizza.htm</a> </p>"
    ]
  }
}
