{
  "title": "Tranches Triangulaires",
  "metadata": {
    "type": "comptage"
  },
  "main_version": {
    "statement": "Considérez le gâteau ci-dessous – un hexagone à six côtés. Maintenant, divisez-le en triangles en coupant le long des diagonales qui ne peuvent se rencontrer qu'aux sommets, un exemple est donné en rouge. Cette division en triangles est appelée une triangulation. De combien de façons pouvez-vous le faire?\n<p><img alt=\"\" src=\"images/Triangular_Slices_image_0.png\" class=\"Triangular_Slices_image_0\" /></p>",
    "correct_answer": "14",
    "hint": "<p>De combien de façons pourriez-vous le faire si le gâteau était un carré ? Et s'il s'agissait d'un pentagone à cinq côtés ? Pouvez-vous utiliser les symétries de votre gâteau pour compter plus rapidement ?</p>",
    "explanation": "<p>Il est préférable de commencer par une question plus simple et de chercher des motifs. Commencez par regarder un carré. Il y a deux façons différentes de couper le gâteau. </p>\n<p><img alt=\"\" src=\"assets/images/Triangular_Slices_image_1.png\" class=\"Triangular_Slices_image_1\" /></p>\n<p>Pour un pentagone, il y a cinq façons :</p>\n<p><img alt=\"\" src=\"assets/images/Triangular_Slices_image_2.png\" class=\"Triangular_Slices_image_2\" /></p>\n<p>Pour un hexagone, il y a 14 façons comme vous pouvez le voir ci-dessous :</p>\n<p><img alt=\"\" src=\"assets/images/Triangular_Slices_image_3.png\" class=\"Triangular_Slices_image_3\" /></p>\n<p>Dans ce diagramme, vous pouvez voir que la solution est trouvée en pensant à 6 + 3 + 2 + 3 = 14, mais vous pouvez arriver à la solution en faisant 5 + 2 + 2 + 5 = 14 où 5 est la réponse pour un pentagone et 2 est la réponse pour un carré (<em>je ne sais pas comment expliquer cela - besoin d'adapter l'explication de l'Extension 1</em>).</p>\n<p>La combinaison équivalente pour le pentagone est 2 + 1 + 2 = 5, où 1 est le résultat du triangle (qui n'a bien sûr qu'une seule option) et 2 est le résultat pour un carré.</p>\n<p>C'est une technique plus utile pour passer à la réflexion sur les polygones avec plus de sommets.</p>"
  },
  "extension_1": {
    "statement": "<p>Pouvez-vous trouver la réponse à la même question si le gâteau a la forme d'un heptagone à sept côtés ?</p>",
    "hint": "<p>Pouvez-vous réutiliser les résultats précédents pour calculer ce nombre ? Compter explicitement pourrait être trop long. Pouvez-vous trouver un moyen de réduire le problème dans des cas plus simples que vous avez déjà comptés ? Concentrez-vous sur le moment où un bord fixe de l'heptagone est présent dans un certain triangle. L'heptagone est alors divisé en deux parties, celle à gauche du triangle ci-dessus et celle à droite. Les deux parties sont plus petites...</p>",
    "correct_answer": "42",
    "explanation": "<p>Numérotons les sommets de l'heptagone de 1 à 7 dans le sens antihoraire. Concentrons notre attention sur un bord fixe, disons celui avec les sommets 1 et 2. Lorsque le bord est présent dans le triangle avec le sommet supplémentaire 3, l'heptagone est divisé en ce triangle et l'hexagone à sa gauche (avec les sommets 1, 3, 4, 5, 6 et 7). Pour ce dernier, le problème est exactement le même que celui que vous avez résolu auparavant, c'est-à-dire que vous obtenez 14 façons de le trianguler. Ensuite, considérez quand le bord fixe forme un triangle avec le sommet 4. À droite de ce triangle, vous avez un triangle (avec les sommets 2, 3 et 4), tandis qu'à gauche, vous avez un pentagone (avec les sommets 1, 4, 5, 6 et 7) pour lequel nous savons que vous pouvez faire 5 triangulations. Par conséquent, ce cas vous fournit 5×1 = 5 triangulations.\nConsidérons le cas où le bord fixe forme un triangle avec un sommet 5. Tant à droite de ce triangle qu'à gauche, vous avez un carré : un avec les sommets 2, 3, 4 et 5, et l'autre avec les sommets 1, 5, 6 et 7. Chaque carré peut être triangulé indépendamment de 2 façons, donc ce cas vous fournit 2×2 = 4 triangulations.\nNous continuons avec le bord fixe formant un triangle avec les sommets 6 puis 7.\nNous avons épuisé toutes les façons possibles dont le bord fixe peut apparaître dans une triangulation. De plus, dans chaque triangulation possible, chaque bord doit faire partie d'un triangle. Donc ci-dessus, nous avons couvert tous les cas possibles, ce qui s'ajoute à : 14 + 1×5 + 2×2 + 5×1 + 14 = 42.</p>\n<p>Nous pouvons trouver une formule pour le nombre Cₙ de triangulations du (n + 2)-gone. En généralisant ce que nous avons fait auparavant, nous avons que :\nCₙ = Cₙ₋₁ + C₁×Cₙ₋₂ + C₂×Cₙ₋₃ + … + Cₙ₋₂×C₁ + Cₙ₋₁\nLe iᵗʰ terme correspond au nombre de triangulations possibles lorsque le bord fixe forme un triangle avec le sommet (i + 2), où i est un nombre de 1 à n. D'après ce que nous avons vu : C₁ = 1, C₂ = 2, C₃ = 5, C₄ = 14, C₅ = 42, ….</p>"
  },
  "extension_2": {
    "statement": "<p>Pouvez-vous trouver la réponse à la même question si le gâteau a la forme d'un nonagone à neuf côtés ?</p>",
    "hint": "<p>Pouvez-vous utiliser la formule pour trouver la réponse pour une forme à huit côtés afin d'avoir toutes les valeurs nécessaires pour trouver la réponse pour une forme à neuf côtés ?</p>",
    "correct_answer": "429",
    "explanation": "<p>Jusqu'à présent, le résultat pour 3, 4, 5, 6 et 7 côtés, dont les résultats sont respectivement 1, 2, 5, 14 et 42). Pour trouver 8 côtés, nous pouvons faire 42 + 1×14 + 2×5 + 5×2 + 14×1 + 42 = 132. Enfin, pour 9 côtés, nous avons 132 + 1×42 + 2×14 + 5×5 + 14×2 + 42×1 + 132 = 429.</p>"
  },
  "additional_information": {
    "about": "<p>Ces Cₙ sont appelés <em>nombres de Catalan</em> et ils sont cruciaux dans le monde de la combinatoire. Il existe une formule explicite pour eux, mais la trouver dépasse largement nos objectifs : la définition récursive ci-dessus est plus que suffisante pour l'instant ! Fait intéressant, il existe de nombreux puzzles différents qui mènent à ces nombres (plus de 200 !) … peut-être avez-vous vu un autre puzzle avec les mêmes réponses ?</p>",
    "references": ""
  }
}
