{
  "title": "Marquer des Buts",
  "metadata": {
    "type": "counting"
  },
  "main_version": {
    "statement": "<p>En finale d'une coupe de football, le score était de 5 - 2. Dans combien d'ordres possibles les buts peuvent-ils être marqués dans le match ?</p>",
    "correct_answer": "21",
    "hint": "<p>Imaginez la séquence de tous les buts et réfléchissez aux positions dans la séquence dans lesquelles la deuxième équipe de football a pu marquer ses 2 buts. Essayez de trouver la réponse dans les cas où le score était de 3 - 2 ou 4 - 2.</p>",
    "explanation": "<p>Imaginez que le score n'était que de 3 - 2. Pensons aux trois buts marqués par la première équipe (domicile) (HHH) et aux deux buts marqués par la deuxième équipe (extérieur) (AA). Nous pourrions essayer de lister les possibilités. Par exemple, AAHHH représenterait les deux premiers buts marqués par l'équipe extérieure, puis les trois buts suivants marqués par l'équipe à domicile. Toutes les options pour les cinq buts sont : AAHHH, AHAHH, AHHAH, AHHHA, HAAHH, HAHAH, HAHHA, HHAAH, HHAHA, HHHAA. Il y a 10 options au total. Une façon de calculer cela est de penser qu'il y a 5 options pour un but extérieur : _ _ _ _ _. Cela pourrait être dans l'une des 5 positions (par exemple, A _ _ _ _). L'autre but extérieur pourrait être dans l'une des 4 positions restantes. Donc, vous penseriez qu'il y aurait 5×4 = 20 façons de choisir où les deux buts iraient. Cependant, nous avons compté deux fois, car nous avons inclus chaque possibilité (par exemple, AAHHH) deux fois (un but en position 1 et l'autre en position 2 mais aussi l'inverse). L'ordre dans lequel nous avons sélectionné les 2 buts de la deuxième équipe n'a pas d'importance : nous devons diviser par 2. Donc la réponse si le score était de 5 - 2 est 5×4 / 2 = 10.</p><p>Pour la question de savoir combien de façons les buts peuvent être marqués si le score est de 5 - 2, nous pouvons utiliser la même logique. Il y a 7 possibilités de sélectionner la position pour un but ; puis il y a 7 - 1 = 6 possibilités de sélectionner la position de l'autre but (-1 parce qu'une position a déjà été sélectionnée), donc vous obtenez 7×6 = 42. Cependant, l'ordre dans lequel vous avez sélectionné les 2 buts de l'équipe extérieure n'a pas d'importance : vous devez diviser par 2. Donc nous obtenons 7×6 / 2 = 21.</p>"
  },
  "extension_1": {
    "statement": "<p>En finale d'une coupe de football, le score était de 6 - 2. Dans combien d'ordres possibles les buts peuvent-ils être marqués dans le match ?</p>",
    "hint": "<p>Pensez à la stratégie que vous avez utilisée pour répondre à la question précédente et essayez de la généraliser pour n'importe quel nombre de buts marqués par la première équipe.</p>",
    "correct_answer": "28",
    "explanation": "<p>La réponse est 8×7 / 2 = 28.</p><p>Ce problème est équivalent à compter combien de façons vous sélectionnez 2 objets (les positions des deux buts de la deuxième équipe dans la séquence ci-dessus) parmi un total de n objets (le nombre total de positions des buts). Cela se calcule par le nombre de <em>combinaisons</em> nC2 = n! / (2!×(n-2)!) = n×(n - 1) / 2.</p><p>Dans cette formule, n! = n×(n - 1)×(n - 2)×...×1.</p><p>Vous pouvez utiliser cela pour arriver à la formule généralisant le raisonnement dans la partie précédente : il y a n possibilités de sélectionner la position du premier but de la deuxième équipe ; puis il y a (n - 1) possibilités de sélectionner la position du deuxième but de la deuxième équipe (-1 parce qu'une position a déjà été sélectionnée), donc vous obtenez n×(n-1). Cependant, l'ordre dans lequel vous avez sélectionné les 2 positions pour les deux buts dans la séquence n'a pas d'importance : vous devez diviser par 2.</p>"
  },
  "extension_2": {
    "statement": "<p>En finale d'une coupe de football, le score était de 4 - 3. Dans combien d'ordres possibles les buts peuvent-ils être marqués dans le match ?</p>",
    "hint": "<p>Pensez à combien de buts ont été marqués au total. Dans combien de positions le premier but de la deuxième équipe pourrait-il être marqué ? Le deuxième ? Le troisième ?</p>",
    "correct_answer": "35",
    "explanation": "<p>Si nous pensons à la séquence de 4 + 3 = 7 buts (G1, G2, G3, G4, G5, G6, et G7), alors le problème est équivalent à compter combien de façons vous sélectionnez 3 objets (les positions des trois buts de la deuxième équipe dans la séquence ci-dessus) parmi un total de 7 objets (le nombre total de positions des buts). Il y a 7 possibilités de sélectionner la position pour le premier but ; puis il y a 7 - 1 = 6 possibilités de sélectionner la position du deuxième but (-1 parce qu'une position a déjà été sélectionnée) ; il y a 7 - 2 = 5 possibilités de sélectionner la position du troisième but (-2 parce que deux positions ont déjà été sélectionnées). Donc vous obtenez 7×6×5 = 210. Cependant, l'ordre dans lequel vous avez sélectionné les 3 buts de la deuxième équipe n'a pas d'importance : vous devez diviser par le nombre de façons dont vous pouvez ordonner les 3 buts. Vous avez 3 façons de choisir le premier but ; puis vous avez 3 - 1 = 2 façons de choisir le deuxième (-1 parce qu'un but a déjà été sélectionné) ; il y a 3 - 2 = 1 possibilité de sélectionner le troisième but (-2 parce que deux buts ont déjà été sélectionnés) ; donc vous obtenez 3×2×1 = 6 façons dont vous pouvez ordonner 3 buts. Enfin, vous pouvez trouver le résultat en faisant : 210 / 6 = 35.</p><p>35 est la réponse pour réarranger HHHHAAA, tandis que 210 serait la réponse pour réarranger HHHHA1A2A3.</p>"
  },
  "additional_information": {
    "about": "<p>La combinatoire est un domaine des mathématiques principalement concerné par le comptage. Deux grands aspects de la combinatoire sont de trouver des combinaisons et des permutations. Pour les combinaisons, l'ordre n'a pas d'importance - comme dans notre exemple de football, nous ne nous soucions pas de l'ordre dans lequel l'équipe extérieure a marqué les buts. Pour les permutations, l'ordre a de l'importance - par exemple, il y a six façons de ranger les chiffres 123.</p>",
    "references": [
      "<p><a href=\"https://www.mathsisfun.com/combinatorics/combinations-permutations.html\" target=”_blank”>https://www.mathsisfun.com/combinatorics/combinations-permutations.html</a></p>",
      "<p><a href=\"https://betterexplained.com/articles/easy-permutations-and-combinations\" target=”_blank”>https://betterexplained.com/articles/easy-permutations-and-combinations</a></p>"
    ]
  }
}
