{
  "title": "Poignées de main à la table",
  "metadata": {
    "type": "comptage"
  },
  "main_version": {
    "statement": "<p>Si 8 personnes sont assises autour d'une table circulaire, de combien de façons peuvent-elles toutes se serrer la main en même temps avec une autre personne à la table de manière à ce que leurs bras ne se croisent pas ? (Elles ont des bras très longs).</p>",
    "correct_answer": "14",
    "hint": "<p>Quel est le résultat si nous avons seulement 2 personnes, ou 4 personnes, ou 6 personnes ? Pouvez-vous trouver un moyen de faire en sorte que les cas avec moins de personnes vous aident à compter les cas avec plus de personnes ?</p>",
    "explanation": "<p>Pour le cas avec 2 personnes, il n'y a qu'une seule façon :</p>\n<p><img alt=\"\" src=\"assets/images/Table_Handshakes_image_0.png\" class=\"Table_Handshakes_image_0\" /></p>\n<p>Pour 4 personnes, il y a 2 façons :</p>\n<p><img alt=\"\" src=\"assets/images/Table_Handshakes_image_1.png\" class=\"Table_Handshakes_image_1\" /><img alt=\"\" src=\"assets/images/Table_Handshakes_image_2.png\" class=\"Table_Handshakes_image_2\" /></p>\n<p>Pour 6 personnes, nous pouvons considérer les options pour la personne numéro 1. La personne 1 ne peut pas se serrer la main avec la personne numéro 3 ou 5 car cela laisserait quelqu'un coupé du groupe. Si la personne 1 se serre la main avec la personne numéro 2 comme ceci :</p>\n<p><img alt=\"\" src=\"assets/images/Table_Handshakes_image_3.png\" class=\"Table_Handshakes_image_3\" /></p>\n<p>Alors nous savons que les autres quatre personnes peuvent se serrer la main de 2 manières différentes (en utilisant notre résultat précédent). La personne 1 pourrait se serrer la main avec la personne 6 et il y aurait aussi 2 manières différentes pour les autres quatre de se serrer la main. Enfin, la personne 1 pourrait se serrer la main avec la personne 4, et cela laisserait juste une option :</p>\n<p><img alt=\"\" src=\"assets/images/Table_Handshakes_image_4.png\" class=\"Table_Handshakes_image_4\" /></p>\n<p>Donc le résultat pour 6 personnes est : 5 = 2 + 1 + 2.</p>\n<p>Pour huit personnes, la personne 1 pourrait se serrer la main avec la personne 2 (laissant un groupe de 6 personnes pour lequel nous savons maintenant qu'il y a 5 façons de se serrer la main), la personne 4 (laissant un groupe de 4, donc 2 façons), la personne 6 (laissant un groupe de 4, donc 2 façons) ou la personne 8 (laissant un groupe de 6, donc 5 façons). Donc la réponse pour huit personnes est 5 + 2 + 2 + 5.</p>"
  },
  "extension_1": {
    "statement": "<p>Que se passe-t-il si nous avons 10 personnes à la table ? Il peut être utile d'utiliser les résultats précédents pour vous aider !</p>",
    "hint": "<p>Compter explicitement peut être trop long. Pouvez-vous trouver un moyen de réduire le problème en utilisant des cas plus simples que vous avez déjà comptés ? Concentrez-vous sur le fait qu'une personne fixe se serre la main avec une autre : le problème se divise en une partie gauche et une partie droite où un nombre inférieur de personnes doit se serrer la main.</p>",
    "correct_answer": "42",
    "explanation": "<p>Numérotant les personnes de 1 à 10 dans le sens antihoraire. Concentrons-nous sur une personne fixe, disons la personne 1. Lorsque la personne 1 se serre la main avec la personne numéro 2, il reste 10 - 2 = 8 personnes à sa gauche qui doivent se serrer la main. Pour eux, c'est le problème que nous avions auparavant, avec 8 personnes à la table elles peuvent se serrer la main de 14 façons différentes. Maintenant, imaginez que la personne 1 veut se serrer la main avec la personne 3 : cela laisserait la personne 2 seule, car chaque tentative de cette dernière de se serrer la main avec d'autres croiserait la poignée de main des personnes 1 et 3. Par conséquent, la personne 1 doit passer la personne 3 et se serrer la main avec la personne 4. À sa droite, il y a les personnes 2 et 3 qui ne peuvent se serrer la main qu'une seule façon, tandis qu'à sa gauche, il y a 10 - 2 - 2 = 6 personnes qui peuvent se serrer la main de 5 façons (comme calculé précédemment), donc nous avons 1 × 5 = 5 possibilités dans ce cas. Considérons maintenant les personnes 1 et 5 : il y aura une personne parmi les personnes 2, 3, 4 qui restera seule, donc la personne 1 doit se rendre à la personne 6. Dans ce cas, nous aurons 4 personnes à droite (les personnes 2, 3, 4, 5) et 4 personnes à gauche (les personnes 7, 8, 9, 10). Chaque groupe peut indépendamment se serrer la main de 2 façons, donc le total est 2 × 2 = 4. Nous continuons avec la personne 1 se serrant la main avec la personne 8 (obtenant 1 × 5 = 5 façons) puis avec la personne 10 (obtenant 14 façons). Nous avons épuisé toutes les façons possibles pour la personne 1 de se serrer la main, donc ci-dessus nous avons couvert tous les cas possibles, qui s'additionnent à : 14 + 1 × 5 + 2 × 2 + 5 × 1 + 14 = 42.</p>\n<p>Penser à ce problème de cette manière conduit à une formule pour calculer le nombre de poignées de main Hₙ où n est le nombre (pair) de personnes à la table :</p>\n<p>Hₙ = Hₙ₋₂ + H₂ × Hₙ₋₄ + H₄ × Hₙ₋₆ + … + Hₙ₋₄ × H₂ + H₂</p>\n<p>Par exemple, pour 10 personnes à la table :</p>\n<p>H₁₀ = H₈ + H₂ × H₆ + H₄ × H₄ + H₆ × H₂ + H₈ = 14 + 1 × 5 + 2 × 2 + 5 × 1 + 14 = 42</p>"
  },
  "extension_2": {
    "statement": "<p>Que se passe-t-il si nous avons 14 personnes à la table ? Pouvez-vous utiliser les résultats précédents pour calculer le nombre de façons dont elles peuvent se serrer la main ?</p>",
    "hint": "<p>Vous devrez d'abord trouver le résultat pour 12 personnes afin de pouvoir utiliser ce résultat (et tous vos résultats précédents) pour trouver la réponse pour 14.</p>",
    "correct_answer": "429",
    "explanation": "<p>Soit Hₙ le nombre de façons dont n personnes se serrent la main. Dans les solutions précédentes, nous avons calculé les nombres H₂, H₄, H₆, H₈, et H₁₀. Nous savons que la formule pour 14 personnes nécessite de calculer d'abord pour 12 personnes. Nous calculons donc :</p>\n<p>H₁₂ = H₁₀ + H₂ × H₈ + … + H₈ × H₂ + H₁₀ = 132</p>\n<p>Et de la même manière, nous pouvons ensuite calculer H₁₄ = 429.</p>"
  },
  "additional_information": {
    "about": "<p>La séquence des nombres que nous avons découverts 1, 2, 5, 14, 42, ... s'appelle les <em>nombres de Catalan</em> et ils sont cruciaux dans le monde de la combinatoire. Il y a des preuves de leur utilisation en Chine dès 1730, mais ils portent le nom du mathématicien belge Eugène Charles Catalan (1814–1894).</p>",
    "references": [
      "<p><a href=\"https://en.wikipedia.org/wiki/Catalan_number\" target=\"_blank\">https://en.wikipedia.org/wiki/Catalan_number</a></p>"
    ]
  }
}
