{
  "title": "Newspaper",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>Below is a single sheet from a newspaper. Given that each sheet has four pages, how many sheets are there altogether?</p>\n<p><img alt=\"\" src=\"images/Newspaper_image_0.png\" class=\"Newspaper_image_0\" /></p>",
    "correct_answer": "17",
    "hint": "<p>Can you work backwards from 8 to work out how many sheets would be underneath this one? You might want to use bits of paper and number them to help.</p>",
    "explanation": "<p>On the back of the number 8 there must be the number 7. The sheet below must have the numbers 6 and 5. Keeping going there will be 4 and 3 and finally 2 and 1. So there are three sheets underneath. Adding on 7 to the 61 gives the last page as 68. Given each sheet has four pages, there are <img alt=\"\" src=\"images/Newspaper_image_1.png\" class=\"Newspaper_image_1\" /> sheets.</p>"
  },
  "extension_1": {
    "statement": "<p>If it takes 852 digits to number all the pages of a book, in the usual order, what is the number on the last page of the book?</p>",
    "hint": "<p>How many 1 digit numbers are there? How many 2 digit numbers?</p>",
    "correct_answer": "320",
    "explanation": "<p>There are 9 one-digit numbers (the numbers 1 - 9), 90 two-digit numbers (the numbers 10 - 99) and 900 three-digits numbers (the numbers 100 - 999). Altogether this would make <img alt=\"\" src=\"images/Newspaper_image_2.png\" class=\"Newspaper_image_2\" /> digits, so the number of pages is less than 999. There are <img alt=\"\" src=\"images/Newspaper_image_3.png\" class=\"Newspaper_image_3\" /> digits used in three digit numbers. <img alt=\"\" src=\"images/Newspaper_image_4.png\" class=\"Newspaper_image_4\" />, so there are 221 three digit numbers. <img alt=\"\" src=\"images/Newspaper_image_5.png\" class=\"Newspaper_image_5\" /> gives us the answer.  </p>"
  },
  "extension_2": {
    "statement": "<p>Numbering the pages of a book requires printing 123 nines. What is the minimum number of pages the book could have?</p>",
    "hint": "<p>How many 9s are there in the first 100 numbers?</p>",
    "correct_answer": "1019",
    "explanation": "<p>Think about the numbers under 1000 first. The following numbers have 9s in them: 9, 19, 29, ...99, 109, 119, 129, …, 199, 209, 219, …, 999. One-digit numbers: 1 nine, two-digit numbers: 10 nines (remember to count both in the number 99!), three-digit numbers: 110 nines (10 for each of the 10 sets of three-digit numbers and 10 for the ones that start with a 9). This gives <img alt=\"\" src=\"images/Newspaper_image_6.png\" class=\"Newspaper_image_6\" />. We want to use two more nines, so we can need 1009 and 1019. The minimum number of pages is therefore 1019.</p>"
  },
  "additional_information": {
    "about": "<p>You can try this puzzle with a real newspaper - take out one of the sheets and look at the numbers on it. Work out how many sheets there should be and then see if you are correct. </p>",
    "references": [
      "<p><a href=\"https://nrich.maths.org/7180\">https://nrich.maths.org/7180</a></p>"
    ]
  }
}
