{
  "title": "Restaurant",
  "metadata": {
    "type": "puzzle"
  },
  "main_version": {
    "statement": "<p>At a restaurant each table has 3 legs, each chair has 4 legs and all the customers and the three members of staff have 2 legs each. There are four chairs at each table. Three quarters of the chairs are occupied by customers and there are 206 legs altogether in the restaurant. How many chairs does the restaurant have?</p>",
    "correct_answer": "32",
    "hint": "<p>Can you work out how many legs there are at each table if three quarters of the chairs have people on them?</p>",
    "explanation": "<p>The three members of staff have six legs so take this off the total, giving 206-6=200. Now the tables, chairs and customers have 200 legs. On average, at each table there are 3 table legs, 16 chair legs and 6 customer legs (as only three quarters of the chairs are taken).This gives 25 legs per table. 200 divided by 25 is 8, hence there are 8 tables, hence 32 chairs. </p>"
  },
  "extension_1": {
    "statement": "<p>I have 30 coins. Some of the coins are 1¢, some are 2¢ and some are 6¢. The value of the 6¢ coins is worth the same amount as the total value of the 1¢ coins and the 2¢ coins combined. Given that I have a different amount of each type of coin, what is the total value of all of the coins (in ¢)?</p>",
    "hint": "<p>Start by considering how many 6¢ coins I could have...if I have too many, I won't be able to match their value with the 1¢ coins and the 2¢ coins.</p>",
    "correct_answer": "84",
    "explanation": ""
  },
  "extension_2": {
    "statement": "<p>[Statement of an extension to the puzzle, fun fact, game or activity]</p>",
    "hint": "<p>[For puzzles: a hint towards the solution of the extension]</p>",
    "correct_answer": "[For puzzles: the correct answer for the extension]",
    "explanation": "<p>[Explanation of the extended fun fact or solution to the puzzle extension.]</p>"
  },
  "additional_information": {
    "about": "<p>This puzzle was originally a problem from a UKMT maths challenge  </p>",
    "references": ""
  }
}
