{
  "title": "Benford's Law",
  "metadata": {
    "type": "funfact"
  },
  "main_version": {
    "statement": "<p>Most sets of numbers spanning many orders of magnitude have the same distribution of first digits 1,...,9.</p>\n<p>When you look at numbers found in real-world data sets, for most sets of numbers the first digit is more often a 1 than any other digit. Also, 2 is a more common first digit than a 3, and so on up to 9. In fact, the percentage of numbers with different first digits often follow the same pattern (distribution).</p>\n<p><img alt=\"\" src=\"images/Benford_s_Law_image_0.png\" class=\"Benford_s_Law_image_0\" /></p>\n<p>(credit for image [we could easily make ourselves]: https://andreacirilloblog.files.wordpress.com/2015/02/plot_benford1.png)</p>\n<p><img alt=\"\" src=\"images/Benford_s_Law_image_1.png\" class=\"Benford_s_Law_image_1\" /></p>",
    "hint": "<p>Have a look at some data sets that span many orders of magnitude. For example, what are the first digits of: the first 100 prime numbers (or more!), the populations of the countries in Africa, the heights of the tallest buildings in the world?</p>",
    "explanation": "<p>Many data sets (for example, populations of countries, heights of buildings, stock prices) or famous sequences (Fibonnacci numbers, prime numbers) are of very different scales (orders of magnitude). Many of these big sets of data arise from decreasing power laws, a simple example might be  </p>\n<p><img alt=\"\" src=\"images/Benford_s_Law_image_2.png\" class=\"Benford_s_Law_image_2\" /> where <img alt=\"\" src=\"images/Benford_s_Law_image_3.png\" class=\"Benford_s_Law_image_3\" /></p>\n<p>Power laws will look like a straight line on semi-log graph paper. </p>\n<p><img alt=\"\" src=\"images/Benford_s_Law_image_4.png\" class=\"Benford_s_Law_image_4\" /> and so <img alt=\"\" src=\"images/Benford_s_Law_image_5.gif\" class=\"Benford_s_Law_image_5\" /></p>\n<p><img alt=\"\" src=\"images/Benford_s_Law_image_6.png\" class=\"Benford_s_Law_image_6\" /></p>\n<p>(image credit to  <a href=\"https://www.intmath.com/exponential-logarithmic-functions/7-graphs-log-semilog.php\">https://www.intmath.com/exponential-logarithmic-functions/7-graphs-log-semilog.php</a>)</p>\n<p>Notice the lines 1, 2, 3, 4,…,10 aren't evenly spaced on the y-axis any more. The length of the power-law line between 1 and 2, is much bigger than the distance spent between 2 and 3, which is bigger than between 3 and 4 (the same for 10 and 20 versus 20 and 30). This spacing is what leads to Benford's Law. </p>"
  },
  "extension_1": {
    "statement": "<p>Can you think of which sets of numbers do not obey Benford's law?</p>",
    "hint": "<p>The explanation of Benford's law mentioned that the data set typically spans many orders of magnitude.</p>",
    "explanation": "<p>Anything that is within a small range, an example would be something normally distributed E.g Measure everyone's height (in metres). Almost all heights would begin with a 1.</p>"
  },
  "additional_information": {
    "about": "<p>Benford's Law is used in the real world to check for fraud on big data sets. If they don't follow the law when they should, it is possible they have been falsified!</p>",
    "references": ""
  }
}
